
## Plan Result




<pre><code>Plan: 5 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.sdp-database
  * azurerm_key_vault_secret.sdp-host
  * azurerm_key_vault_secret.sdp-port
  * postgresql_grant.readonly_mv
  * postgresql_role.create_sdp_access
* Update
  * azurerm_key_vault_secret.secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.secret[&#34;USER&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.sdp-database will be created
  + resource "azurerm_key_vault_secret" "sdp-database" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "subscription-management-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "application"         = "publishing-information-service"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "subscription-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-host will be created
  + resource "azurerm_key_vault_secret" "sdp-host" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "subscription-management-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "application"         = "publishing-information-service"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "subscription-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.sdp-port will be created
  + resource "azurerm_key_vault_secret" "sdp-port" {
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-sdp-kv-stg"
      + name                    = "subscription-management-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
          + "application"         = "publishing-information-service"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#publishing-and-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Publishing Information Project"
          + "source"              = "subscription-management PostgreSQL"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-11-22T12:03:07Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-DATABASE/3e62e90316ef459cb89b23e2a0cee0f7"
        name                    = "subscription-management-POSTGRES-DATABASE"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-11-22T12:03:07Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-HOST/be002f6a124f404a8596d9ff4cf43928"
        name                    = "subscription-management-POSTGRES-HOST"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-11-22T12:03:07Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-PASS/a193939b6f2349e8b4100382fe7b7d2c"
        name                    = "subscription-management-POSTGRES-PASS"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-11-22T12:03:07Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-PORT/c3e31332076742a386aafb8919678403"
        name                    = "subscription-management-POSTGRES-PORT"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-11-22T12:03:07Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/subscription-management-POSTGRES-USER/882b9df0edbc4ba29630662a59fde87d"
        name                    = "subscription-management-POSTGRES-USER"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-subscription-management.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "subscription-management PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # postgresql_grant.readonly_mv will be created
  + resource "postgresql_grant" "readonly_mv" {
      + database          = "subscriptionmanagement"
      + id                = (known after apply)
      + object_type       = "table"
      + objects           = [
          + "sdp_mat_view_subscription",
        ]
      + privileges        = [
          + "SELECT",
        ]
      + role              = (sensitive)
      + schema            = "public"
      + with_grant_option = false
    }

  # postgresql_role.create_sdp_access will be created
  + resource "postgresql_role" "create_sdp_access" {
      + bypass_row_level_security = false
      + connection_limit          = -1
      + create_database           = false
      + create_role               = false
      + encrypted_password        = true
      + id                        = (known after apply)
      + inherit                   = true
      + login                     = true
      + name                      = (sensitive)
      + password                  = (sensitive value)
      + replication               = false
      + skip_drop_role            = true
      + skip_reassign_owned       = true
      + superuser                 = false
      + valid_until               = "infinity"
    }

Plan: 5 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":111,"Program":"tfcmt","SHA1":"","Vars":{}} -->